{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "lstm_9/kernel", "shape": [5, 1024], "dtype": "float32"}, {"name": "lstm_9/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_9/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_13/kernel", "shape": [256, 5], "dtype": "float32"}, {"name": "dense_13/bias", "shape": [5], "dtype": "float32"}, {"name": "dense_14/kernel", "shape": [256, 5], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [5], "dtype": "float32"}, {"name": "lstm_10/kernel", "shape": [5, 1024], "dtype": "float32"}, {"name": "lstm_10/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_10/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [256, 5], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [5], "dtype": "float32"}]}]}